In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv(r'data/ds_salaries.csv')

### PREPROCESAMIENTO

In [3]:
df.head()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2023,SE,FT,Principal Data Scientist,80000,EUR,85847,ES,100,ES,L
1,2023,MI,CT,ML Engineer,30000,USD,30000,US,100,US,S
2,2023,MI,CT,ML Engineer,25500,USD,25500,US,100,US,S
3,2023,SE,FT,Data Scientist,175000,USD,175000,CA,100,CA,M
4,2023,SE,FT,Data Scientist,120000,USD,120000,CA,100,CA,M

In [4]:
df.columns #saber las columnas

Index(['work_year', 'experience_level', 'employment_type', 'job_title',
       'salary', 'salary_currency', 'salary_in_usd', 'employee_residence',
       'remote_ratio', 'company_location', 'company_size'],
      dtype='object')

In [5]:
df.shape #saber las dimensiones

(3755, 11)

In [7]:
df.dtypes #saber los tipos de datos

work_year              int64
experience_level      object
employment_type       object
job_title             object
salary                 int64
salary_currency       object
salary_in_usd          int64
employee_residence    object
remote_ratio           int64
company_location      object
company_size          object
dtype: object

In [8]:
df.isnull().sum() #saber los valores nulos

work_year             0
experience_level      0
employment_type       0
job_title             0
salary                0
salary_currency       0
salary_in_usd         0
employee_residence    0
remote_ratio          0
company_location      0
company_size          0
dtype: int64

In [9]:
df.duplicated().sum() #saber los valores duplicados

np.int64(1171)

In [10]:
def mas_repetidos(df):
    df_duplicados = df[df.duplicated(keep=False)]
    df_agrupado = df_duplicados.groupby(df.columns.tolist()).size().reset_index().rename(columns={0: 'count'})
    df_ordenado = df_agrupado.sort_values(by='count', ascending=False)
    return df_ordenado

mas_repetidos(df)

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size,count
223,2022,SE,FT,Data Scientist,191475,USD,191475,US,100,US,M,21
201,2022,SE,FT,Data Scientist,141525,USD,141525,US,100,US,M,21
399,2023,SE,FT,Data Engineer,129000,USD,129000,US,0,US,M,13
441,2023,SE,FT,Data Engineer,252000,USD,252000,US,0,US,M,13
221,2022,SE,FT,Data Scientist,185900,USD,185900,US,0,US,M,12
...,...,...,...,...,...,...,...,...,...,...,...,...
510,2023,SE,FT,Data Scientist,239748,USD,239748,US,0,US,M,2
508,2023,SE,FT,Data Scientist,228000,USD,228000,US,0,US,M,2
507,2023,SE,FT,Data Scientist,225000,USD,225000,US,100,US,M,2
504,2023,SE,FT,Data Scientist,201000,USD,201000,US,0,US,M,2
503,2023,SE,FT,Data Scientist,200160,USD,200160,US,0,US,M,2

In [11]:
df.drop_duplicates(inplace=True) #eliminar duplicados

In [12]:
df.shape

(2584, 11)

### EDA

In [13]:
df.head(1)

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2023,SE,FT,Principal Data Scientist,80000,EUR,85847,ES,100,ES,L

¿de que pais son la compañias mas grande?

In [21]:
def compania_grande(df, columna):
    conteo = df[columna].value_counts()
    valor_mas = conteo.idxmax()
    cantidad_repeticiones = conteo.max()
    return valor_mas, cantidad_repeticiones

valor, repeticiones = compania_grande(df, 'company_location')
print(f"La compañia más grande es: {valor}, con {repeticiones}")

'''
df1 = df.loc[df['company_size'] == 'L','company_location'].value_counts().idxmax()
df2 = df.loc[df['company_size'] == 'L','company_location'].value_counts().max()
print(f'El pais donde estan las compañia mas grande es: {df1} con: {df2}')
'''

La compañia más grande es: US, con 1929

"\ndf1 = df.loc[df['company_size'] == 'L','company_location'].value_counts().idxmax()\ndf2 = df.loc[df['company_size'] == 'L','company_location'].value_counts().max()\nprint(f'El pais donde estan las compañia mas grande es: {df1} con: {df2}')\n"

En que puesto se gana mas

In [39]:
# def salario_max(df, columna):
  #  maxim_usd = df[columna].value_counts()
  #  valor_max = maxim_usd.idxmax()
  #  return valor_max

# valor, trabajo = salario_max(df, 'salary_in_usd')
# print(f'El trabajo mas pagado es: {valor} con {trabajo}')

# df3 = df.loc[df('job_title')['salary_in_usd']].max

# df.groupby('job_title')['salary_in_usd'].max()

df3, df4 = df.groupby('job_title')['salary_in_usd'].max().idxmax(), df.groupby('job_title')['salary_in_usd'].max().max(0)
print(f'El trabajo más pagado es: {df3} con un salario de: {df4}')

El trabajo más pagado es: Research Scientist con un salario de: 450000

Tipo de trabajo, pais de residencia donde mas se cobra?

El pais donde estan las compañia mas grande es: US con: 220

¿El nivel de  experiencia es proporcional al salario

In [ ]:
df2 = df.loc[df['']]

cuanto se cobra de media por cada nivel de experiencia?

en qué tamaño de compañía trabajan más

por que porcentage promedio se aumenta el salario entre nivel de experiencia

en que pais se cobra  mas por tipo de empleo?

In [44]:
df.groupby(['company_location','job_title']).agg({'salary_in_usd':'mean'}).round(2).sort_values(by=['salary_in_usd','company_location'],ascending=False)

                                                salary_in_usd
company_location job_title
IL               AI Scientist                        423834.0
US               Data Analytics Lead                 405000.0
                 Data Science Tech Lead              375000.0
IN               AI Developer                        300000.0
US               Director of Data Science            294375.0
...                                                       ...
CH               Big Data Engineer                     5882.0
IN               Data Science Consultant               5707.0
                 3D Computer Vision Researcher         5409.0
                 Power BI Developer                    5409.0
CZ               NLP Engineer                          5132.0

[356 rows x 1 columns]

wich are experience level more required

quiero decir, cuáles se repiten más en este set de datos, las empresas medianas, grandes o pequeñas